SELECT USER
FROM DUAL;
--==> SCOTT



-- ■■■ UNION / UNION ALL ■■■ --

--○ 실습 테이블 생성
-- 테이블명: TBL_JUMUN
CREATE TABLE TBL_JUMUN              -- 주문 테이블 생성
( JUNO      NUMBER                  -- 주문 번호
, JECODE    VARCHAR2(30)            -- 주문된 제품 코드
, JUSU      NUMBER                  -- 주문 수량
, JUDAY     DATE DEFAULT SYSDATE    -- 주문 일자
);
--==>> Table TBL_JUMUN이(가) 생성되었습니다.

--○ 데이터 입력(→ 고객의 주문 발생/ 접수)
INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(1, '오감자', 20, TO_DATE('2001-11-01 09:10:12','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(2, '자유시간', 10, TO_DATE('2001-11-01 09:23:37','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(3, '포카칩', 30, TO_DATE('2001-11-01 11:41:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(4, '홈런볼', 12, TO_DATE('2001-11-02 10:00:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(5, '죠리퐁', 50, TO_DATE('2001-11-03 15:50:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(6, '쫄병스낵', 40, TO_DATE('2001-11-04 20:20:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(7, '포키', 20, TO_DATE('2001-11-20 10:10:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(8, '치토스', 30, TO_DATE('2001-11-22 14:20:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(9, '홈런볼', 30, TO_DATE('2001-11-24 04:40:20','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(10, '오감자', 12, TO_DATE('2001-11-25 10:10:10','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(11, '홈런볼', 30, TO_DATE('2001-11-25 15:15:15','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(12, '프링글스', 20, TO_DATE('2001-11-26 12:10:42','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(13, '치토스', 20, TO_DATE('2001-11-26 12:11:10','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(14, '홈런볼', 20, TO_DATE('2001-11-27 10:00:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(15, '초코송이', 10, TO_DATE('2001-11-27 12:00:00','YYYY-MM-DD HH24:MI:SS'));

INSERT INTO TBL_JUMUN(JUNO, JECODE, JUSU, JUDAY)
VALUES(16, '치토스', 30, TO_DATE('2001-11-29 14:22:08','YYYY-MM-DD HH24:MI:SS'));
--==>> 1 행 이(가) 삽입되었습니다. * 16

ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD HH24:MI:SS';
--==>> Session이(가) 변경되었습니다.

--○ 확인
SELECT *
FROM TBL_JUMUN;
--==>>
/*
1	오감자	    20	2001-11-01 09:10:12
2	자유시간	10	2001-11-01 09:23:37
3	포카칩	    30	2001-11-01 11:41:00
4	홈런볼	    12	2001-11-02 10:00:00
5	죠리퐁	    50	2001-11-03 15:50:00
6	쫄병스낵	40	2001-11-04 20:20:00
7	포키	    20	2001-11-20 10:10:00
8	치토스	    30	2001-11-22 14:20:00
9	홈런볼	    30	2001-11-24 04:40:20
10	오감자	    12	2001-11-25 10:10:10
11	홈런볼	    30	2001-11-25 15:15:15
12	프링글스	20	2001-11-26 12:10:42
13	치토스	    20	2001-11-26 12:11:10
14	홈런볼	    20	2001-11-27 10:00:00
15	초코송이	10	2001-11-27 12:00:00
16	치토스	    30	2001-11-29 14:22:08
*/

--○ 커밋
COMMIT;
--==>> 커밋 완료.

--○ 데이터 추가 입력 → 2001년부터 시작된 주문이 현재(2026년)까지 계속 발생
INSERT INTO TBL_JUMUN VALUES(938765, '홈런볼', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938766, '포카칩', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938767, '감자깡', 20, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938768, '새우깡', 20, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938769, '홈런볼', 30, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938770, '초코송이', 30, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938771, '치토스', 20, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938772, '죠리퐁', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938773, '자유시간', 50, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938774, '포카칩', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938775, '포카칩', 20, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938776, '홈런볼', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

SELECT *
FROM TBL_JUMUN;
--==>>
/*
1	    오감자	    20	2001-11-01 09:10:12
2	    자유시간	10	2001-11-01 09:23:37
3	    포카칩	    30	2001-11-01 11:41:00
4	    홈런볼	    12	2001-11-02 10:00:00
5	    죠리퐁	    50	2001-11-03 15:50:00
6	    쫄병스낵	40	2001-11-04 20:20:00
7	    포키	    20	2001-11-20 10:10:00
8	    치토스	    30	2001-11-22 14:20:00
9	    홈런볼	    30	2001-11-24 04:40:20
10	    오감자	    12	2001-11-25 10:10:10
11	    홈런볼	    30	2001-11-25 15:15:15
12	    프링글스	20	2001-11-26 12:10:42
13	    치토스	    20	2001-11-26 12:11:10
14	    홈런볼	    20	2001-11-27 10:00:00
15	    초코송이	10	2001-11-27 12:00:00
16	    치토스	    30	2001-11-29 14:22:08
                    :
                    :
938765	홈런볼	    10	2026-01-08 14:12:42
938766	포카칩	    10	2026-01-08 14:13:14
938767	감자깡	    20	2026-01-08 14:13:39
938768	새우깡	    20	2026-01-08 14:14:05
938769	홈런볼	    30	2026-01-08 14:14:34
938770	초코송이	30	2026-01-08 14:14:58
938771	치토스	    20	2026-01-08 14:15:21
938772	죠리퐁	    10	2026-01-08 14:15:44
938773	자유시간	50	2026-01-08 14:16:10
938774	포카칩	    10	2026-01-08 14:16:38
938775	포카칩	    20	2026-01-08 14:16:57
938776	홈런볼	    10	2026-01-08 14:17:14
*/

--※ 주열이가 2001년도부터 과자 쇼핑물 운영 중
--   TBL_JUMUN 테이블이 매우 무거워진 상황
--   어플리케이션과의 연동으로 인해 주문 내역을
--   다른 테이블에 저장할 수 있도록 만드는 것은 힘든 상황
--   이제부터 다른 테이블에 저장해 나갈 수 있도록 만드는 것을 힘든 상황
--   기존의 모든 데이터를 덮어놓고 지우는 것도 불가능한 상황
--   → 결과적으로
--      현재까지 누적된 주문 데이터들 중
--      아직 발송 처리하지 않은 금일 주문 내역을 제외하고
--      나머지를 다른 테이블로 데이터 이관을 수행할 계획

--○ TBL_JUMUN 테이블에서 금일 발생한 주문 내역을 제외하고
--   나머지 데이터 조회
SELECT *
FROM TBL_JUMUN
WHERE TO_CHAR(SYSDATE, 'YYYY-MM-DD') != TO_CHAR(JUDAY, 'YYYY-MM-DD');
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
*/

--○ 위의 조회 결과로 TBL_JUMUNBACKUP 테이블 생성

CREATE TABLE TBL_JUMUNBACKUP
AS
SELECT *
FROM TBL_JUMUN
WHERE TO_CHAR(SYSDATE, 'YYYY-MM-DD') != TO_CHAR(JUDAY, 'YYYY-MM-DD');
--==>> Table TBL_JUMUNBACKUP이(가) 생성되었습니다.

SELECT *
FROM TBL_JUMUNBACKUP;
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
*/
--> TBL_JUMUN 테이블의 데이터들 중
--  금일 주문내역 이외의 데이터는 모두 TBL_JUMUNBACKUP 테이블에 백업을 마친 상태

--○ TBL_JUMUN 테이블의 데이터들 중
--   데이터를 이관한 내용들은 모두 삭제
DELETE
FROM TBL_JUMUN
WHERE TO_CHAR(SYSDATE, 'YYYY-MM-DD') != TO_CHAR(JUDAY, 'YYYY-MM-DD');
--==>> 16개 행 이(가) 삭제되었습니다.
--     → 938764건의 데이터가 삭제된 것으로 가정

-- 아직 제품 발송이 완료되지 않은 금일 주문 데이터를 제외하고
-- 이전의 모든 주문 데이터들이 삭제된 상황이므로
-- 테이블의 행(레코드)의 갯수가 줄어들어 매우 가벼워진 상황

--○ 확인
SELECT *
FROM TBL_JUMUN;
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938766 포카칩                                 10 2026-01-08 14:13:14
    938767 감자깡                                 20 2026-01-08 14:13:39
    938768 새우깡                                 20 2026-01-08 14:14:05
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938772 죠리퐁                                 10 2026-01-08 14:15:44
    938773 자유시간                               50 2026-01-08 14:16:10
    938774 포카칩                                 10 2026-01-08 14:16:38
    938775 포카칩                                 20 2026-01-08 14:16:57
    938776 홈런볼                                 10 2026-01-08 14:17:14
*/

--○ 커밋
COMMIT;
--==>> 커밋 완료.

-- 그런데, 지금까지 주문받은 내역에 대한 전체 데이터를
-- 제품별 총 주문량으로 나타내어야 할 상황이 발생하게 되었다.
-- 그렇다면 TBL_JUMUNBACKUP 테이블의 레코드(행)와
-- TBL_JUMUN 테이블의 레코드(행)를 합쳐서
-- 하나의 테이블로 조회화는 것과 같은
-- 결과를 확인할 수 있도록 조회해야 한다.

-- 컬럼과 컬럼의 관계를 고려하여 테이블을 결합하고자 하는 경우 JOIN을 사용하지만
-- 레코드(행)와 레코드(행)을 결합하고자 하는 경우 UNION / UNION ALL을 사용할 수 있다.

SELECT *
FROM TBL_JUMUNBACKUP
UNION
SELECT *
FROM TBL_JUMUN;
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938766 포카칩                                 10 2026-01-08 14:13:14
    938767 감자깡                                 20 2026-01-08 14:13:39
    938768 새우깡                                 20 2026-01-08 14:14:05
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938772 죠리퐁                                 10 2026-01-08 14:15:44
    938773 자유시간                               50 2026-01-08 14:16:10
    938774 포카칩                                 10 2026-01-08 14:16:38
    938775 포카칩                                 20 2026-01-08 14:16:57
    938776 홈런볼                                 10 2026-01-08 14:17:14
*/

SELECT *
FROM TBL_JUMUNBACKUP
UNION ALL
SELECT *
FROM TBL_JUMUN;
--==>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938766 포카칩                                 10 2026-01-08 14:13:14
    938767 감자깡                                 20 2026-01-08 14:13:39
    938768 새우깡                                 20 2026-01-08 14:14:05
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938772 죠리퐁                                 10 2026-01-08 14:15:44
    938773 자유시간                               50 2026-01-08 14:16:10
    938774 포카칩                                 10 2026-01-08 14:16:38
    938775 포카칩                                 20 2026-01-08 14:16:57
    938776 홈런볼                                 10 2026-01-08 14:17:14
*/


SELECT *
FROM TBL_JUMUN
UNION
SELECT *
FROM TBL_JUMUNBACKUP;
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938766 포카칩                                 10 2026-01-08 14:13:14
    938767 감자깡                                 20 2026-01-08 14:13:39
    938768 새우깡                                 20 2026-01-08 14:14:05
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938772 죠리퐁                                 10 2026-01-08 14:15:44
    938773 자유시간                               50 2026-01-08 14:16:10
    938774 포카칩                                 10 2026-01-08 14:16:38
    938775 포카칩                                 20 2026-01-08 14:16:57
    938776 홈런볼                                 10 2026-01-08 14:17:14
*/

SELECT *
FROM TBL_JUMUN
UNION ALL
SELECT *
FROM TBL_JUMUNBACKUP;
--==>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938766 포카칩                                 10 2026-01-08 14:13:14
    938767 감자깡                                 20 2026-01-08 14:13:39
    938768 새우깡                                 20 2026-01-08 14:14:05
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938772 죠리퐁                                 10 2026-01-08 14:15:44
    938773 자유시간                               50 2026-01-08 14:16:10
    938774 포카칩                                 10 2026-01-08 14:16:38
    938775 포카칩                                 20 2026-01-08 14:16:57
    938776 홈런볼                                 10 2026-01-08 14:17:14
         1 오감자                                 20 2001-11-01 09:10:12
         2 자유시간                               10 2001-11-01 09:23:37
         3 포카칩                                 30 2001-11-01 11:41:00
         4 홈런볼                                 12 2001-11-02 10:00:00
         5 죠리퐁                                 50 2001-11-03 15:50:00
         6 쫄병스낵                               40 2001-11-04 20:20:00
         7 포키                                   20 2001-11-20 10:10:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        12 프링글스                               20 2001-11-26 12:10:42
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
*/

--※ UNION은 항상 결과물의 첫 번째 컬럼을 기준으로 오름차순 정렬을 수행한다.
--   UNION ALL은 결합된 순서대로(쿼리문의 구성 순서) 조회한 결과를 반환한다. (정렬 없음)
--   이로 인해 UNION의 부하가 더 크다.
--   또한, UNION은 결과물에서 중복된 행이 존재할 경우
--   중복을 제거하고 한 개 행만 조회된 결과를 반환하게 된다.

--○ 지금까지 주문받은 모든 데이터를 통해
--   제품별 총 주문량을 조회하는 쿼리문을 구성한다.
/*
------------------------------
    제품코드    총주문량
------------------------------
    .....          xx
    .....          xx
------------------------------
*/

SELECT T.JECODE "제품코드", SUM(T.JUSU) "총주문량"
FROM (
    SELECT *
    FROM TBL_JUMUN
    UNION ALL
    SELECT *
    FROM TBL_JUMUNBACKUP
) T
GROUP BY T.JECODE;
--==>>
/*
포키	    20
새우깡	    20
치토스	    100
쫄병스낵	40
포카칩	    70
초코송이	40
오감자	    32
홈런볼	    142
감자깡	    20
자유시간	60
프링글스	20
죠리퐁	    60
*/

SELECT T.JECODE "제품코드",  SUM(T.JUSU) "총주문량"
FROM
(
    SELECT JECODE, JUSU
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT JECODE, JUSU
    FROM TBL_JUMUN
)T
GROUP BY T.JECODE;
--==>>
/*
제품코드                         총주문량
------------------------------ ----------
포키                                   20
쫄병스낵                               40
치토스                                100
새우깡                                 20
오감자                                 32
포카칩                                 70
초코송이                               40
자유시간                               60
홈런볼                                142
프링글스                               20
감자깡                                 20
죠리퐁                                 60
*/

SELECT T.JECODE "제품코드",  SUM(T.JUSU) "총주문량"
FROM
(
    SELECT JECODE, JUSU
    FROM TBL_JUMUNBACKUP
    UNION
    SELECT JECODE, JUSU
    FROM TBL_JUMUN
)T
GROUP BY T.JECODE;
--==>>
/*
제품코드                         총주문량
------------------------------ ----------
포키                                   20
새우깡                                 20
쫄병스낵                               40
치토스                                 50
오감자                                 32
초코송이                               40
포카칩                                 60
감자깡                                 20
자유시간                               60
프링글스                               20
홈런볼                                 72
죠리퐁                                 60
*/

-- ※ 이 문제를 해결하는 과정에서 UNION을 사용해서는 안된다.
--   → JECODE와 JUSU를 조회하는 과정에서 중복된 행을 제거하고 처리하는 상황이 발생


--○ INTERSECT / MINUS (→ 교집합, 차집합)

-- TBL_JUMUNBACKUP 테이블과 TBL_JUMUN 테이블에서
-- 제품코드와 주문량의 값이 똑같은 행만 추출하고자 한다.

SELECT JECODE, JUSU
FROM TBL_JUMUNBACKUP;
SELECT JECODE, JUSU
FROM TBL_JUMUN;

SELECT JECODE, JUSU
FROM TBL_JUMUNBACKUP
INTERSECT
SELECT JECODE, JUSU
FROM TBL_JUMUN;
--==>>
/*
치토스	20
홈런볼	30
*/

SELECT JECODE, JUSU
FROM TBL_JUMUNBACKUP
MINUS
SELECT JECODE, JUSU
FROM TBL_JUMUN;
--==>>
/*
오감자	    12
오감자	    20
자유시간	10
죠리퐁	    50
쫄병스낵	40
초코송이	10
치토스	    30
포카칩	    30
포키	    20
프링글스	20
홈런볼	    12
홈런볼	    20
*/

--○ 데이터 추가 입력
INSERT INTO TBL_JUMUN VALUES(938777, '오감자', 20, TO_DATE('2026-01-08 15:03:11','YYYY-MM-DD HH24:MI:SS'));
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938778, '오감자', 20, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938779, '초코송이', 10, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.

INSERT INTO TBL_JUMUN VALUES(938780, '홈런볼', 12, SYSDATE);
--==>> 1 행 이(가) 삽입되었습니다.


COMMIT;
--==>>커밋 완료.


--○ TBL_JUMUNBACKUP 테이블과 TBL_JUMUN 테이블에서
--  『제품코드』와 『주문량』의 값이 똑같은 행의 정보를
--   주문번호, 제품코드, 주문수량, 주문일자 항목으로 조회한다.

SELECT *
FROM TBL_JUMUNBACKUP;

SELECT *
FROM TBL_JUMUN
;

SELECT T2.JUNO "주문번호", T1.JECODE "제품코드", T1.JUSU "주문수량", T2.JUDAY "주문일자"
FROM
(
    SELECT JECODE, JUSU
    FROM TBL_JUMUNBACKUP
    INTERSECT
    SELECT JECODE, JUSU
    FROM TBL_JUMUN
) T1 JOIN 
(   
    SELECT *
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT *
    FROM TBL_JUMUN
) T2
ON T1.JECODE = T2.JECODE AND T1.JUSU = T2.JUSU;

--

SELECT JUNO "주문번호", JECODE "제품코드", JUSU "주문수량", JUDAY "주문일자"
FROM TBL_JUMUNBACKUP
WHERE (JECODE, JUSU) IN
    (
        SELECT JECODE, JUSU
        FROM TBL_JUMUNBACKUP
        INTERSECT
        SELECT JECODE, JUSU
        FROM TBL_JUMUN
    )
UNION ALL
SELECT JUNO "주문번호", JECODE "제품코드", JUSU "주문수량", JUDAY "주문일자"
FROM TBL_JUMUN
WHERE (JECODE, JUSU) IN
    (
        SELECT JECODE, JUSU
        FROM TBL_JUMUNBACKUP
        INTERSECT
        SELECT JECODE, JUSU
        FROM TBL_JUMUN
    );


-- 모범 풀이
SELECT JECODE, JUSU
FROM TBL_JUMUNBACKUP
INTERSECT
SELECT JECODE, JUSU
FROM TBL_JUMUN;
--==>>
/*
오감자	20
초코송이	10
치토스	20
홈런볼	12
홈런볼	30
*/

SELECT JUNO, JECODE, JUSU, JUDAY
FROM TBL_JUMUNBACKUP
INTERSECT
SELECT JUNO, JECODE, JUSU, JUDAY
FROM TBL_JUMUN;
--==>> 조회 결과 없음

SELECT T2.JUNO "주문번호", T1.JECODE "제품코드", T1.JUSU "주문수량", T2.JUDAY "주문일자"
FROM
(
    SELECT JECODE, JUSU
    FROM TBL_JUMUNBACKUP
    INTERSECT
    SELECT JECODE, JUSU
    FROM TBL_JUMUN
) T1
JOIN
(
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUN

) T2
ON T1.JECODE = T2.JECODE 
    AND T1.JUSU = T2.JUSU;

--==>>
/*

주문번호     제품코드                       주문수량         주문일자               
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         4 홈런볼                                 12 2001-11-02 10:00:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        11 홈런볼                                 30 2001-11-25 15:15:15
        13 치토스                                 20 2001-11-26 12:11:10
        15 초코송이                               10 2001-11-27 12:00:00
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938771 치토스                                 20 2026-01-08 14:15:21
    938778 오감자                                 20 2026-01-08 16:03:33
    938779 초코송이                               10 2026-01-08 16:04:14
    938780 홈런볼                                 12 2026-01-08 16:04:53
    938777 오감자                                 20 2026-01-08 15:03:11
*/


SELECT *
FROM
(
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUN
)
WHERE JECODE IN ('오감자','초코송이','치토스','홈런볼')
    AND JUSU IN (20,10,20,12,30);
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         4 홈런볼                                 12 2001-11-02 10:00:00
         8 치토스                                 30 2001-11-22 14:20:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        10 오감자                                 12 2001-11-25 10:10:10
        11 홈런볼                                 30 2001-11-25 15:15:15
        13 치토스                                 20 2001-11-26 12:11:10
        14 홈런볼                                 20 2001-11-27 10:00:00
        15 초코송이                               10 2001-11-27 12:00:00
        16 치토스                                 30 2001-11-29 14:22:08
    938765 홈런볼                                 10 2026-01-08 14:12:42
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938770 초코송이                               30 2026-01-08 14:14:58
    938771 치토스                                 20 2026-01-08 14:15:21
    938776 홈런볼                                 10 2026-01-08 14:17:14
    938778 오감자                                 20 2026-01-08 16:03:33
    938779 초코송이                               10 2026-01-08 16:04:14
    938780 홈런볼                                 12 2026-01-08 16:04:53
    938777 오감자                                 20 2026-01-08 15:03:11
*/

SELECT *
FROM
(
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUN
)
-- WHERE JECODE||JUSU IN ('오감자20','초코송이10','치토스20','홈런볼12','홈런볼30');
-- WHERE CONCAT(JECODE,JUSU) IN ('오감자20','초코송이10','치토스20','홈런볼12','홈런볼30');
WHERE CONCAT(JECODE,JUSU) =ANY ('오감자20','초코송이10','치토스20','홈런볼12','홈런볼30');
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         4 홈런볼                                 12 2001-11-02 10:00:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        11 홈런볼                                 30 2001-11-25 15:15:15
        13 치토스                                 20 2001-11-26 12:11:10
        15 초코송이                               10 2001-11-27 12:00:00
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938771 치토스                                 20 2026-01-08 14:15:21
    938778 오감자                                 20 2026-01-08 16:03:33
    938779 초코송이                               10 2026-01-08 16:04:14
    938780 홈런볼                                 12 2026-01-08 16:04:53
    938777 오감자                                 20 2026-01-08 15:03:11
*/


SELECT *
FROM
(
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUNBACKUP
    UNION ALL
    SELECT JUNO, JECODE, JUSU, JUDAY
    FROM TBL_JUMUN
)
--WHERE CONCAT(JECODE,JUSU) =ANY ('오감자20','초코송이10','치토스20','홈런볼12','홈런볼30');
WHERE CONCAT(JECODE,JUSU) =ANY (   
                                SELECT CONCAT(JECODE, JUSU)
                                FROM TBL_JUMUNBACKUP
                                INTERSECT
                                SELECT CONCAT(JECODE, JUSU)
                                FROM TBL_JUMUN
                                );
--==>>
/*
      JUNO JECODE                               JUSU JUDAY              
---------- ------------------------------ ---------- -------------------
         1 오감자                                 20 2001-11-01 09:10:12
         4 홈런볼                                 12 2001-11-02 10:00:00
         9 홈런볼                                 30 2001-11-24 04:40:20
        11 홈런볼                                 30 2001-11-25 15:15:15
        13 치토스                                 20 2001-11-26 12:11:10
        15 초코송이                               10 2001-11-27 12:00:00
    938769 홈런볼                                 30 2026-01-08 14:14:34
    938771 치토스                                 20 2026-01-08 14:15:21
    938778 오감자                                 20 2026-01-08 16:03:33
    938779 초코송이                               10 2026-01-08 16:04:14
    938780 홈런볼                                 12 2026-01-08 16:04:53
    938777 오감자                                 20 2026-01-08 15:03:11
*/


SELECT D.DEPTNO, D.DNAME, E.ENAME, E.SAL
FROM EMP E JOIN DEPT D
ON E.DEPTNO = D.DEPTNO;


-- CHECK (알아만 두자)
SELECT DEPTNO, DNAME, ENAME, SAL
FROM EMP NATURAL JOIN DEPT;
-- 리소스 소모 큼 알아서 자연스럽게 조인

SELECT DEPTNO, DNAME, ENAME, SAL
FROM EMP JOIN DEPT
USING(DEPTNO);
-- NATURAL JOIN보단 낫지만 그래도











