--○ 과제
-- 본인이 태어나서 현재까지
-- 얼마만큼의 일, 시간, 분, 초를 살고 있는지
-- 조회하는 쿼리문을 구성한다.
/*
---------------------------------------------------------------------
현재 시각            |  태어난일시         | 일  | 시간 | 분 | 초
---------------------------------------------------------------------
2026-01-06 10:27:5   | 1991-09-05 08:45:00  | XXXX | XX  | XX | XX
---------------------------------------------------------------------
*/

SELECT SYSDATE "현재시각"
     , TO_DATE('1991-09-05 08:45:00', 'YYYY-MM-DD HH24:MI:SS') "태어난일시"
     , TRUNC(SYSDATE -  TO_DATE('1991-09-05 08:45:00', 'YYYY-MM-DD HH24:MI:SS')) "일"
     , TRUNC(MOD((SYSDATE -  TO_DATE('1991-09-05 08:45:00', 'YYYY-MM-DD HH24:MI:SS')) * 24, 24)) "시간"
     , TRUNC(MOD((SYSDATE -  TO_DATE('1991-09-05 08:45:00', 'YYYY-MM-DD HH24:MI:SS'))* (24*60),60)) "분"
     , TRUNC(MOD((SYSDATE -  TO_DATE('1991-09-05 08:45:00', 'YYYY-MM-DD HH24:MI:SS')) * (24*60*60), 60)) "초"
FROM DUAL;
