SELECT USER
FROM DUAL;
--==>> SCOTT

SELECT *
FROM TBL_SAWON;
--==>>
/*
      SANO SANAME                         JUBUN         HIREDATE          SAL
---------- ------------------------------ ------------- ---------- ----------
      1001 Á¶¼¼ºó                         9804112234567 2026-01-06        100
      1002 °­¸íÃ¶                         0002113234567 2017-01-05       2000
      1003 ÀÌ¼öºó                         0709063234567 2005-08-16       5000
      1004 Á¤¼¼Âù                         9104281234567 1998-02-10       6000
      1005 ÀÌÀç¿ë                         7512121234567 2018-02-22       7700
      1006 ÀÌÀÌ¿µ                         8904051234567 2009-06-05       1000
      1007 ¾ÆÀÌÀ¯                         9304022234567 2012-07-13       3000
      1008 ÀÌ»óÀÌ                         8512161234567 1999-08-16       2000
      1009 ³²±Ã¹Î                         0102033234567 2010-07-01       1000
      1010 À±ÁÖ¿­                         0502203234567 2015-10-20       3000
      1011 ¼±µ¿¿­                         7012181234567 1990-10-10       3000
      1012 ¼±¿ì¿ë³à                       7205062234567 1998-08-08       2000
      1013 ³²Èñ¼®                         7509231234567 2002-05-15       1000
      1014 ¼±¿ì¼±                         0203044234567 2012-05-13       2000
      1015 ³²±Ã¹Î                         0512123234567 2015-07-13       1000
      1016 ³²Áø                           7108051234567 1999-07-13       2000
      1017 Á¤¿ì                           8502031234567 1999-10-10       2000
*/


--¡Û TBL_SAWON Å×ÀÌºí ¹é¾÷
--   (¡æ ´Ü¼ø µ¥ÀÌÅÍ º¹»ç, 2026-01-13 14:48:20)
CREATE TABLE TBL_SAWONBACKUP
AS
SELECT *
FROM TBL_SAWON;
--==>> Table TBL_SAWONBACKUPÀÌ(°¡) »ý¼ºµÇ¾ú½À´Ï´Ù.
--> TBL_SAWON Å×ÀÌºíÀÇ µ¥ÀÌÅÍµé¸¸ ¹é¾÷À» ¼öÇà
-- Áï, ´Ù¸¥ ÀÌ¸§ÀÇ Å×ÀÌºí ÇüÅÂ·Î ÀúÀåÇØ µÐ »óÈ²

--¡Û È®ÀÎ
SELECT *
FROM TBL_SAWONBACKUP;
SELECT *
FROM TBL_SAWON;

--¡Û 1001 Á¶¼¼ºó µ¥ÀÌÅÍ º¯°æ
UPDATE TBL_SAWON
SET SANAME = '¶Ê¶ÊÀÌ';
COMMIT;
--==>> 17°³ Çà ÀÌ(°¡) ¾÷µ¥ÀÌÆ®µÇ¾ú½À´Ï´Ù.
--==>> Ä¿¹Ô ¿Ï·á.

SELECT *
FROM TBL_SAWON;
--==>>
/*
      SANO SANAME                         JUBUN         HIREDATE          SAL
---------- ------------------------------ ------------- ---------- ----------
      1001 ¶Ê¶ÊÀÌ                         9804112234567 2026-01-06        100
      1002 ¶Ê¶ÊÀÌ                         0002113234567 2017-01-05       2000
      1003 ¶Ê¶ÊÀÌ                         0709063234567 2005-08-16       5000
      1004 ¶Ê¶ÊÀÌ                         9104281234567 1998-02-10       6000
      1005 ¶Ê¶ÊÀÌ                         7512121234567 2018-02-22       7700
      1006 ¶Ê¶ÊÀÌ                         8904051234567 2009-06-05       1000
      1007 ¶Ê¶ÊÀÌ                         9304022234567 2012-07-13       3000
      1008 ¶Ê¶ÊÀÌ                         8512161234567 1999-08-16       2000
      1009 ¶Ê¶ÊÀÌ                         0102033234567 2010-07-01       1000
      1010 ¶Ê¶ÊÀÌ                         0502203234567 2015-10-20       3000
      1011 ¶Ê¶ÊÀÌ                         7012181234567 1990-10-10       3000
      1012 ¶Ê¶ÊÀÌ                         7205062234567 1998-08-08       2000
      1013 ¶Ê¶ÊÀÌ                         7509231234567 2002-05-15       1000
      1014 ¶Ê¶ÊÀÌ                         0203044234567 2012-05-13       2000
      1015 ¶Ê¶ÊÀÌ                         0512123234567 2015-07-13       1000
      1016 ¶Ê¶ÊÀÌ                         7108051234567 1999-07-13       2000
      1017 ¶Ê¶ÊÀÌ                         8502031234567 1999-10-10       2000
*/


ROLLBACK;
--==>> ·Ñ¹é ¿Ï·á.

--¡Ø À§¿Í °°ÀÌ UPDATE Ã³¸® ÀÌÈÄ¿¡ COMMITÀ» ÇÔ²² ¼öÇàÇÏ¿´±â ¶§¹®¿¡
--   ROLLBACKÀº ºÒ°¡´ÉÇÑ »óÈ²ÀÌ´Ù.
--   ±×³ª¸¶, TBL_SAWONBACKUP Å×ÀÌºí¿¡ µ¥ÀÌÅÍ¸¦ ¹é¾÷ÇØ µÎ¾ú´Ù.
--   ´ÙÇàÈ÷ SANAME ÄÃ·³¸¸ ÃßÃâÇÏ¿© '¶Ê¶ÊÀÌ' ´ë½Å ³Ö¾îÁÙ ¼ö ÀÖ´Ù´Â °ÍÀÌ´Ù.

UPDATE TBL_SAWON
SET SANAME = 'Á¶¼¼ºó'
WHERE SANO = 1001;

UPDATE TBL_SAWON
SET SANAME = '°­¸íÃ¶'
WHERE SANO = 1002;

UPDATE TBL_SAWON
SET SANAME = 'ÀÌ¼öºó'
WHERE SANO = 1003;

--      :

UPDATE TBL_SAWON T1
SET SANAME = ( SELECT T2.SANAME
               FROM TBL_SAWONBACKUP T2
               WHERE T1.SANO = T2.SANO);
--==>> 17°³ Çà ÀÌ(°¡) ¾÷µ¥ÀÌÆ®µÇ¾ú½À´Ï´Ù.

              
SELECT T1.SANAME
    ,  (SELECT T2.SANAME
               FROM TBL_SAWONBACKUP T2
               WHERE T1.SANO = T2.SANO) "º¯°æÀÌ¸§"
FROM TBL_SAWON T1;


SELECT *
FROM TBL_SAWON;


COMMIT;
--==>> Ä¿¹Ô ¿Ï·á.










